rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Chicken Run New"], ["director", "Unknown"], ["updated_at", "2015-12-06 15:53:13.182792"], ["id", 20]]

  def similar
    movie = Movie.find(params[:id])
    ordering = {:title => :asc}
    #puts "Director = '#{movie.director}'"
    if movie.director.nil? || movie.director.empty?
      flash[:notice] = "'#{movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(director: movie.director).order(ordering)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ?  ORDER BY "movies"."title" ASC LIMIT 1  [["director", "Nobody"]]